
## :white_check_mark: Apply Succeeded (koyashiro.com)

[CI link](https://github.com/koyashiro/infra/actions/runs/8788969625)



<pre><code>Apply complete! Resources: 5 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_record.cname_root will be created
  + resource "cloudflare_record" "cname_root" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "CNAME"
      + value           = "koyashi.ro"
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.txt_dkim will be created
  + resource "cloudflare_record" "txt_dkim" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "*._domainkey"
      + proxiable       = (known after apply)
      + ttl             = 1
      + type            = "TXT"
      + value           = "v=DKIM1; p="
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.txt_dmarc will be created
  + resource "cloudflare_record" "txt_dmarc" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "_dmarc"
      + proxiable       = (known after apply)
      + ttl             = 1
      + type            = "TXT"
      + value           = "v=DMARC1; p=reject; sp=reject; adkim=s; aspf=s;"
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.txt_keybase_site_verification will be created
  + resource "cloudflare_record" "txt_keybase_site_verification" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + ttl             = 1
      + type            = "TXT"
      + value           = "keybase-site-verification=N6TgXTI6Qgifnnk1WklcW7yDT-te8lJcK62zhaafuqM"
      + zone_id         = (sensitive value)
    }

  # cloudflare_record.txt_spf will be created
  + resource "cloudflare_record" "txt_spf" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + ttl             = 1
      + type            = "TXT"
      + value           = "v=spf1 -all"
      + zone_id         = (sensitive value)
    }

Plan: 5 to add, 0 to change, 0 to destroy.
cloudflare_record.txt_dmarc: Creating...
cloudflare_record.txt_spf: Creating...
cloudflare_record.txt_keybase_site_verification: Creating...
cloudflare_record.txt_dkim: Creating...
cloudflare_record.cname_root: Creating...
cloudflare_record.txt_keybase_site_verification: Creation complete after 1s [id=a043411fdfde83c905ab04931725efa3]
cloudflare_record.txt_dmarc: Creation complete after 1s [id=cd6b1ff62705bd41b1edfe3dcb3a7c39]
cloudflare_record.txt_dkim: Creation complete after 2s [id=59ad6bede38e8e93c3e4bb6555ce6abf]
cloudflare_record.txt_spf: Creation complete after 2s [id=5140e6c03fd33953dac287d2b63e4050]
cloudflare_record.cname_root: Creation complete after 2s [id=0057511e751f885f8c68883dbf5ff27e]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 5 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform-apply","PRNumber":166,"Program":"tfcmt","SHA1":"cb490ea8c771fbe2f85f5822cc4448ad89c9f520","Target":"koyashiro.com","Vars":{},"WorkflowName":"terraform"} -->